---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar
source: html/28bd2688-ecbd-9dd0-9a27-79854596c5b5.htm
---
# StructuralSectionRectangularBar Properties

Common set of parameters for structural analysis.